class Ar {
  static Map<String, String> json = {
    "Create an account?": "انشاء حساب",
    "Let's Sign You In": "هيا نسجل دخولك",
    "Welcome back, you've been missed!": "مرحبًا بعودتك",
    "Email": "البريد الالكتروني",
    "password": "كلمه السر",
    "SIGN IN": "تسجيل دخول",
    "Already have an account?": "هل لديك حساب بالفعل",
    "Sign in": "تسجيل الدخول",
    "Getting Started": "هيا نبدأ",
    "Create an account to continue!": "قم بانشاء حساب للستمرار",
    "Full Name": "الاسم بالكامل",
    "SIGN UP": "انشاء حساب",
    "Search here": "ابحث هنا",
    "Featured": "متميز",
    "See more": "عرض المزيد",
    "Study": "تعليم",
    "Medic": "علاج",
    "Human": "إنساني",
    "Other": "اخرى",
    "Help Them Smile Again": "ساعدهم على الابتسام مرة أخرى",
    "Hello Good People":"مرحبا أهل الخير",
    "Target":"هدف : ",
    "2 Days left":"يتبقي 2 يوم",
    "Details":"التفاصيل",
    "desDetails":"بمجرد أن تكمل تبرعنا ، سنبدأ رحلتها. أولاً ، ستكون أموالك"
  "تحولت إلى طعام ، ثم تم إرسالها إلى واحدة من أكثر من 120 دولة حيث يكون الناس أكثر عرضة للخطر. كل يوم.",
    "Donate Now":"تبرع الان",
    "Donation Amount":"مبلغ التبرع",
    "Other Amount":"مبلغ اخري",
    "Enter your donation amount":"ادخل مبلغ التبرع الخاص بك",
    "Select Payment Method":"اختر طريقه الدفع",
    "Choose the payment method":"اختر طريقه الدفع",
    "More Image":"المزيد من الصور",
    "Your donation has been successful":"لقد تم تبرعك بنجاح",
    "GO BACK TO HOME":"الرجوع الي الصفحه الرئيسيه",
    "Donations":"التبرعات",
    "Added status":"الحالات المضافه",
    "Total amount":"المبلغ الاجمالي",
    "UpDate":"تحديث",

    //drawer
    "Profile":"الحساب الشخصي",
    "notifications":"الاشعارات",
    "Language":"تغيير اللغة",
    "Logout":"تسجيل خروج" ,

    "zakat":"الزكاه",
    "calZakat":"احسب زكاتك الان وتبرع",
    "infZakat":"معلومات عن الزكاة",
    //information
    "Information":"معلومات",
    "inf1":"معلومات عن الزكاه",
    "inf2":"هل الزكاة واجبة ؟",
    "inf3":"زكاة المال واجب شرعي وفريضة إسلامية على كل مسلمٍ عاقل مكلّف قادِر، وهي من أعظم الفرائض لدرجة أن تاركها عمداً قد يعرض نفسه لخطر في عقيدته كمسلم بناءً على إجماع علماء المسلمين. فعن عبدالله بن عمر رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقولُ: “بُنِي الإسلامُ عَلى خَمْسٍ: شَهادةِ أنْ لا إلهَ إلاَّ الله، وأنَّ مُحمَّداً عَبْدُه وَرَسولُهُ، وإقامِ الصلاةِ، وإيتاءِ الزَّكاةِ، وحَجِّ البيتِ، وصَومِ رَمضانَ“. رَواهُ البُخارِي ومُسلمٌ.",
    "inf4":"من الذي تجب عليه الزكاة",
    "inf5":'''وفقًا للمذهب الحنفي، يجب دفع الزكاة على كل مسلم بالغ عاقل ويملك مقدارًا من الثروة (الأصول الصافية) تتجاوز حدّ النصاب.

في حين يرى المذهب الشافعي والمالكي والحنبلي أن الزكاة واجبة أيضًا على الأطفال وعلى المجانين، إذا بلغت ثروتهم حدَ النصاب.

 

وتعني كلمة “النصاب” الحد الأدنى للممتلكات أو الثروة/الأصول التي يجب أن يمتلكها المسلم قبل أن يكون عليه لزاما البدء في دفع الزكاة. ويسمى هذا الحدّ الأدنى للمبلغ بحدّ النصاب.

ويصبح واجبٌ عليك دفع الزكاة في اليوم الذي تصل فيه ثروتك حدّ النصاب. وتُحسب الزكاة وتُدفع عن الثروة بعد مرور سنة قمرية كاملة. ويبلغ طول السنة القمرية حوالي 354 يومًا.

مثال: التحق عبد الله بوظيفة مؤخرًا، وبعد شهر واحد من عمله تلقى مرتبا شهريا بقيمة 1,000 ريال، ولم يكن على عبد الله أي ديون. وبالتالي فإن ثروته هي الألف ريال كاملة. وحد النصاب في حينها هو 190 ريال. وبالتالي يصبح عبد الله مُلزمًا بدفع الزكاة لأن ثروته الجديدة تجاوزت النصاب.

بعد 354 يومًا – سنة هجرية كاملة – حان الوقت لعبد الله لإعادة تقييم وضعه ومعرفة مقدار الثروة/صافي الأصول التي يمتلكها بما يزيد على النصاب.

وجد عبدالله بأنه ادّخر مبلغ 10,000 ريال، وعليه ديون فورية/قصيرة الأجل قدرها 2,000 ريال.

وبالتالي ففي نهاية السنة الهجرية، بلغت ثروة عبد الله أو أصوله الصافية قيمة 8,000 ريال، بينما بلغت قيمة النصاب في ذلك الوقت 200 ريال.

لذلك، سيتعين على عبد الله دفع زكاة مقدارها 200 ريال، وهي عبارة عن 2.5% من مبلغ 8,000 ريال.

يؤدي الكثير من المسلمين الزكاة خلال شهر رمضان، حيث يسهل عليهم تذكر وقتها. وفي كثير من الأحيان يُخرجونها في ليلة السابع والعشرين من رمضان سعيًا منهم في تعظيم الأجر والثواب.

إلا أن الطريقة الشرعية الأصح هي حساب الزكاة وإخراجها بعد سنة هجرية واحدة ابتداء من اليوم الذي تجاوزت فيه ثروتك مبلغ النصاب''',
"inf6":"هل الزكاة واجبة ؟",
    "inf7":"زكاة المال واجب شرعي وفريضة إسلامية على كل مسلمٍ عاقل مكلّف قادِر، وهي من أعظم الفرائض لدرجة أن تاركها عمداً قد يعرض نفسه لخطر في عقيدته كمسلم بناءً على إجماع علماء المسلمين. فعن عبدالله بن عمر رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقولُ: “بُنِي الإسلامُ عَلى خَمْسٍ: شَهادةِ أنْ لا إلهَ إلاَّ الله، وأنَّ مُحمَّداً عَبْدُه وَرَسولُهُ، وإقامِ الصلاةِ، وإيتاءِ الزَّكاةِ، وحَجِّ البيتِ، وصَومِ رَمضانَ“. رَواهُ البُخارِي ومُسلمٌ.",
    "inf8": "هل الزكاة واجبة ؟",
    "inf9":"زكاة المال واجب شرعي وفريضة إسلامية على كل مسلمٍ عاقل مكلّف قادِر، وهي من أعظم الفرائض لدرجة أن تاركها عمداً قد يعرض نفسه لخطر في عقيدته كمسلم بناءً على إجماع علماء المسلمين. فعن عبدالله بن عمر رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقولُ: “بُنِي الإسلامُ عَلى خَمْسٍ: شَهادةِ أنْ لا إلهَ إلاَّ الله، وأنَّ مُحمَّداً عَبْدُه وَرَسولُهُ، وإقامِ الصلاةِ، وإيتاءِ الزَّكاةِ، وحَجِّ البيتِ، وصَومِ رَمضانَ“. رَواهُ البُخارِي ومُسلمٌ.",

    //alms
    "Alms":"صدقه",
    "select amount now and time for handouts":"حدد المبلغ الآن ووقت الصدقات",
    "Choose when to give charity":"اختر وقت التصدق",
    "The amount of charity":"مبلغ الصدقه ",
    "Charity timing":"توقيت التصدق",
    "every":"كل",
    "month":"شهر",
    "Save and confirm":"حفظ وتاكيد",
    "Now you have chosen an amount of 300 to be given in charity every two months automatically":"انت الان اخترت مبلغ ٣٠٠ لتتصدق بهم كل شهرين تلقائي",
    "al1":"معلومات عن الصدقات",
    "al2":"هل الصدقات واجبة",
    "al3":"الصدقة عمل خيري شخصي جداً، ولا تعتبر فريضة دينية، ولكنها مستحبة في الإسلام. ولا تتوقف الصدقة على المساهمات المالية، بل تشمل أعمال الرحمة واللفتات الكريمة أو السخاء بالوقت أو الجهد.",
    "al4":"علي من تجب الصدقه؟",
    "al5":'''الحمد لله، والصلاة والسلام على رسول الله، وعلى آله وصحبه ومن والاه، ثم أما بعد: فإذا كان المرادُ بالصَّدَقَة الزكاةُ الواجبةُ: فتجب على المسلم الحرِّ المالك للنصاب، وبالنسبة لحَوَلان الحَوْل؛ فيشترط في كل الأموال الزكويَّة إلا الزروع والثمار؛ إذ تجبُ الزكاة فيها حين الحصاد. أما المستحقُّون للزكاة: فهم ثمانية أصناف، مذكورون في الآية الستين من سورة التوبة، وهي قوله تعالى: {إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاءِ وَالْمَسَاكِينِ...}، وسوف نبيِّن المقصود بكلٍّ من هذه الأصناف الثمانية بصورة مختصرة: الصنف الأول والثاني: الفقراء والمساكين؛ وهم أهل الحاجة الذين لا يجدون شيئاً، أو يجدون بعض ما يكفيهم، على خلافٍ بين الفقهاء: أيهما أشدّ حاجة؟ وتفصيل ذلك في كتب الفقه. الصنف الثالث: العاملون على الزكاة؛ وهم الذين يتولون جمع الزكاة، ولا يُشترط فيهم وصف الفقر؛ بل يعطوْنَ منها ولو كانوا أغنياء. الصنف الرابع: المؤَّلفة قُلوبُهم؛ وهم الذين يعطوْنَ من الزكاة تأليفاً لقلوبهم للدخول في الإسلام، ومذهب جمهور الفقهاء أن هذا السهم باقٍ، لم يسقط، على خلاف بين الفقهاء في ذلك. الصنف الخامس: في الرقاب؛ وهم على ثلاثة أضرب: الأول: المُكاتَبُون المسلمون؛ فيعانون لفكِّ رقابهم. الثاني: إعتاق الرَّقيق المسلم. الثالث: الأسرى من المسلمين. الصنف السادس: الغارمون؛ وهم المدينون العاجزون عن سداد ديونهم، على تفصيلٍ لذلك في كتب الفقه. الصنف السابع: في سبيل الله، والمراد بذلك إعطاء الغزاة المتطوِّعين للجهاد، وكذا الإنفاق في مصلحة الحرب، وكل ما يحتاجه أمر الجهاد. الصنف الثامن: ابن السبيل؛ وهو المسافر المجتاز، الذي قد فرغت نفقته؛ فيعطى ما يوصله إلى بلده. أما إن كان المراد بالصدقة، الصدقةَ غير الواجبة، كصدقة التطوع: فتستحبُّ لكل مسلم، وله أن يصرفها كيف شاء، والأفضل له أن يتصدَّق على الأقربين، فيُقدِّم الأقرب فالأقرب، مع مراعاة أشدهم حاجة؛ فيُقدَّم على غيره؛ فقد روى أصحاب "السنن"، عن سلمان بن عامر، عن النبي صلى الله عليه وسلم قال: "الصَّدَقَة على المسكين صَدَقَة، وهي على ذي الرَّحِمِ ثنتان: صَدَقَةٌ وصِلَةٌ". قال ابن العربي رحمه الله تعالى في "أحكام القرآن"، عند تفسير قوله تعالى: {يَسْأَلونَكَ مَاذَا يُنْفِقُونَ قُلْ مَا أَنْفَقْتُمْ مِنْ خَيْرٍ فَلِلْوَالِدَيْنِ وَالأَقْرَبِينَ وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ وَمَا تَفْعَلُوا مِنْ خَيْرٍ فَإِنَّ اللَّهَ بِهِ عَلِيمٌ} [البقرة: 215]. قال: "في هذه الآية قولان؛ أحدهما: أنها منسوخةٌ بآية الزكاة، الثاني: أنها مبينة مصاريف صدقة التطوع، وهو الأوْلى؛ لأن النَّسْخ دعوى، وشروطه معدومةٌ هنا، وصدقة التطوع في الأقربين أفضل منها في غيرهم"،، والله أعلم.

رابط المادة: http://iswy.co/e4tbn ''',

    //notifaction
    "no1":"لقد تبرعت بنجاح ، لقد تبرعت للحاله رقم 7594573",
    "no2":"تمت الآن إضافة حالة جديدة يمكنك التبرع لها ومعرفة التفاصيل",
    "no3":"كما تبرع أحمد ياسر وخالد حسين للحاله رقم 7594573",
    //add new state

    "Add New State":"اضافة حالة جديدة",
    "Name of State":"اسم الحالة",
    'mostafa samir mostafa samir':"مصطفي سمير مصطفي سمير ",
    "National Card":"البطاقة الشخصية" ,
    "The target Number":"الرقم المطلوب" ,
    "i.e 2000\$":"i.e 2000\$",
    "Last Date":"اخر موعد" ,
    '2-2-2023':'2-2-2023',
    "Description":"الوصف",
    'Submit':'تاكيد',
    "images of state":"صور للحالة",


    //onBoarding

    'SKIP':'تخطي',
    'Start now with Mughith Program':'ابدأ الآن ببرنامج مغيث',
    'It is possible to donate through the program to any of the presented cases and choose your payment method.':'يمكن التبرع من خلال البرنامج لأي من الحالات المعروضة واختيار طريقة الدفع المفضلة لك.',
    'Mange your Donation':'إدارة تبرعك',
    'You can choose who get the money or you let us mange it.':'يمكنك اختيار من يحصل على المال أو تدعنا نديره.',
    'Monthly Payment': 'الدفع الشهري' ,
    'Through the application, you can pay a constant money per month automatically.':'من خلال التطبيق يمكنك دفع مبلغ ثابت شهريًا بشكل تلقائي.',
    'next':'التالي',
    'Start Now':"ابدأ الان",

    //zakah

    'Zakat calculation':'حساب الذكاة' ,
    "Information about zakat":"معلومات عن الذكاة",
    'Zakat per person':"الذكاة للفرد",

    'pound':'جنيه',
    "Enter the number of people":'ادخل عدد الافراد',
    'total zakat':'اجمالي الذكاة',
    'Do You Want To Pay Now ?':'هل تريد الدفع الان؟',
    'yes':'نعم',
    'not now':'ليس الان',
    "Calculate":"احسب" ,
  };
}
